FV2310/E_0527.puml
@startuml
skinparam Shadowing false
skinparam NoteBorderColor #f3f1f6
skinparam NoteBackgroundColor #f3f1f6
skinparam NoteFontSize 12
skinparam ActivityBorderColor none
skinparam ActivityBackgroundColor #7a8da1
skinparam ActivityFontSize 16
skinparam ArrowColor #7aab8a
skinparam ArrowFontSize 16
skinparam ActivityDiamondBackgroundColor #7aab8a
skinparam ActivityDiamondBorderColor #7aab8a
skinparam ActivityDiamondFontSize 18
skinparam defaultFontName DejaVu Serif Condensed
skinparam ActivityEndColor #669580

header
<b>FV2210
2022-12-12
endheader

title
GPKE

6.37.4: AD Bestellung einer Konfiguration vom NB an MSB



end title
:<b>E_0527</b>;
note right
<b><i>Prüfende Rolle: MSB
end note

if (<b>10: </b> Liegt die Bestellte Konfiguration zum bestellten Zeitpunkt an der / bzw. allen Lokationen bereits vor?) then (ja)
    :A01;
    note left
        Cluster: Ablehnung
        Die bestellte Konfiguration liegt bereits vor
    endnote
    kill;
else (nein)
endif
if (<b>20: </b> Erlaubt die vorhandene Gerätetechnik die Konfiguration zum bestellten Zeitpunkt?) then (ja)
else (nein)
    :A02;
    note left
        Cluster: Ablehnung
        Die vorhandene Gerätetechnik erlaubt die Konfiguration zum bestellten Zeitpunkt nicht.
        Hinweis:
        Wenn die Gerätetechnik eine detailliertere Auflösung als die bestellten Werte bereitstellt, kann diese nicht abgelehnt werden. 
        Beispiel: Messung bietet Lastgang 1/4h Auflösung. Geforderte Werte sind kumulierte Werte.
    endnote
    kill;
endif
if (<b>30: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
    :A99;
    note left
        Cluster: Ablehnung
        Sonstiges
        Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
        Nutzungsmöglichkeit Ende: 01.10.2024 00:00 Uhr
    endnote
    kill;
else (nein)
    :A03;
    note left
        Cluster: Zustimmung
        Die Einrichtung der Konfiguration ist grundsätzlich möglich
    endnote
    kill;
endif

@enduml
